src/AccumulationRegisters/ВзаиморасчетыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыКомпании</Name>
			<Comment>Блок учета взаиморасчетов с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма долга в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, с которым мы ведем взаиморасчеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ отгрузки/поставки/оплаты, по которому образовался долг</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручение</Name>
			<Comment>Платежное поручение (исходящее)</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ОтчетКомитенту</xr:Item>
				<xr:Item>Document.ЗаявкаНаРасходДС</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.СчетОтПоставщика</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Электронно, почтой, телеграфом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетОтПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПлательщика</Name>
					<Comment>ИНН нашей компании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Comment>ИНН контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Comment>Код бюджетной классификации доходов РФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКТМО</Name>
					<Comment>Код ОКТМО сборщика платежей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Получатель денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППлательщика</Name>
					<Comment>КПП нашей компании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППолучателя</Name>
					<Comment>КПП контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Comment>Назначение платежа - текстовая строка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Comment>Очередность платежа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>Истина - это не просто платеж, а перечисление налогов. Ложь - обычный платеж.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Comment>Дата документа - основания перечисления  налога, сбора или иного платежа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Comment>Номер документа - основания перечисления  налога, сбора или иного платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Comment>Условное обозначение основания налогового платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Comment>Условное обозначение периода, за который перечисляется налог</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Comment>Условное обозначение типа налогового платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Comment>Статус составителя платежного документа на перечисление налогов, сборов и иных обязательных платежей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>Расчетный счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>Расчетный счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Comment>Текст плательщика заполняется автоматически в соответствии с информацией, введенной в форму расчетного счета, выбранного для организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Comment>Текст получателя заполняется автоматически в соответствии с информацией, введенной в форму расчетного счета, выбранного для контрагента-покупателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУИН</Name>
					<Comment>Код уникальный идентификатор начислений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ПлатежноРасчетныеДокументыСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Работа с объектами механизма "Платежно расчетные документы"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует таблицу платежно расчетных документов для указанного документа.
//
// Параметры:
//  Документ  - ДокументСсылка - Документ для которого необходимо получить платежно расчетные документы.
//  Договор  - СправочникСсылка.ДоговорыВзаиморасчетов - Договор используется для поиска платежей
//                  в документе "Выписка".
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица с документами вида "Номер" от "Дата".
//                       Одна строка соответствует одному документу.
//
Функция ПолучитьПлатежноРасчетныеДокументы(Документ, Договор=Неопределено) Экспорт
	
	// Подготовим таблицу
	Результат = ПустаяТаблица();
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПостроительЗапроса = Новый ПостроительЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыКомпании.Сделка КАК Сделка
	|ПОМЕСТИТЬ ЗакрытыеСделки
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	|ГДЕ
	|	ВзаиморасчетыКомпании.Регистратор = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВзаиморасчетыКомпании.Регистратор КАК Платеж,
	|	ВзаиморасчетыКомпании.Сделка КАК Сделка,
	|	ВзаиморасчетыКомпании.Период КАК Период
	|ПОМЕСТИТЬ Платежи
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	|ГДЕ
	|	ВзаиморасчетыКомпании.Сделка В
	|			(ВЫБРАТЬ
	|				ЗакрытыеСделки.Сделка
	|			ИЗ
	|				ЗакрытыеСделки КАК ЗакрытыеСделки)
	|	И (ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.Выписка
	|			ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.ЧекНаОплату)
	|{ГДЕ
	|	ВзаиморасчетыКомпании.Период КАК ПериодОтбор}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыпискаСостав.Ссылка КАК Выписка,
	|	ВыпискаСостав.Сделка КАК Сделка,
	|	ВыпискаСостав.НомерВходящегоДокумента КАК Номер,
	|	ВыпискаСостав.ДатаВходящегоДокумента КАК Дата
	|ПОМЕСТИТЬ Выписки
	|ИЗ
	|	Документ.Выписка.Состав КАК ВыпискаСостав
	|ГДЕ
	|	ВыпискаСостав.ДоговорВзаиморасчетов = &Договор
	|	И ВыпискаСостав.Ссылка В
	|			(ВЫБРАТЬ
	|				Платежи.Платеж
	|			ИЗ
	|				Платежи КАК Платежи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Платежи.Платеж КАК Платеж,
	|	ВЫБОР
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ""ПКО""
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.ЧекНаОплату
	|			ТОГДА ""Чек""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Префикс,
	|	ВЫБОР
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.Выписка
	|		ТОГДА ЕстьNull(Выписки.Номер, Платежи.Платеж.НомерВходящегоДокумента)
	|		ИНАЧЕ Платежи.Платеж.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.Выписка
	|		ТОГДА ЕстьNull(Выписки.Дата, Платежи.Платеж.ДатаВходящегоДокумента)
	|		ИНАЧЕ Платежи.Платеж.Дата
	|	КОНЕЦ КАК Дата,
	|	Платежи.Платеж.ХозОперация КАК ХозОперация,
	|	Платежи.Платеж.Номер КАК НомерДополнительный,
	|	Платежи.Платеж.Дата КАК ДатаДополнительная,
	|	Платежи.Период КАК Период
	|ИЗ
	|	Платежи КАК Платежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выписки КАК Выписки
	|		ПО Платежи.Платеж = Выписки.Выписка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Платежи.Период");
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Параметры.Вставить("Основание", Документ);
	ПостроительЗапроса.Параметры.Вставить("Договор", Договор);
	ТипДокумента = ТипЗнч(Документ);
	
	ДатаРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Дата");
	
	Если ЗначениеЗаполнено(ДатаРеализации) Тогда
		
		Отбор = ПостроительЗапроса.Отбор.Добавить("ПериодОтбор");
		Отбор.ВидСравнения = ВидСравнения.Меньше;
		Отбор.Значение = ДатаРеализации;
		Отбор.Использование = Истина;
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Результат.Добавить();
		
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			
			НомерБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Выборка.Номер, "0");
			НоваяСтрока.Номер = СокрЛП(Выборка.Префикс + " " + НомерБезНулей);
			НоваяСтрока.Дата = Выборка.Дата;
			
		ИначеЕсли ТипЗнч(Выборка.Платеж) = Тип("ДокументСсылка.Выписка") Тогда
			
			Если Выборка.ХозОперация <> Справочники.ХозОперации.БанковскаяВыписка Тогда
				
				НомерБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Выборка.НомерДополнительный, "0");
				НоваяСтрока.Номер = СокрЛП(Выборка.Префикс + " " + НомерБезНулей);
				НоваяСтрока.Дата = Выборка.ДатаДополнительная;
				
			Иначе
				
				НоваяСтрока.Номер = НСтр("ru = 'в выписке не указан'");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПлатежноРасчетныеДокументы()

// Выполняет переход на новую структуру метаданных
//
Процедура ВыполнитьОбновлениеВыписок() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Платежно расчетные документы.Начало обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВыпискаСостав.Ссылка КАК Документ,
	|	ВыпискаСостав.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СтрокаБанковскойВыписки) КАК ЭтоСтрока
	|ИЗ
	|	Документ.Выписка.Состав КАК ВыпискаСостав
	|ГДЕ
	|	НЕ ВыпискаСостав.ПлатежноеПоручениеОснование ССЫЛКА Документ.ПлатежноеПоручение
	|	И ВыпискаСостав.ПлатежноеПоручениеОснование <> """"");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоСтрока Тогда
				
				ОбновитьСтрокуВыписки(Выборка.Документ);
				
			Иначе
				
				ОбновитьВыписку(Выборка.Документ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Платежно расчетные документы.Окончание обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация);
	
КонецПроцедуры

// Выполняет переход на новую структуру метаданных.
//
Процедура ВыполнитьОбновлениеСчетовФактур() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Платежно расчетные документы.Начало обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
		УровеньЖурналаРегистрации.Информация);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Документ,
	|	СчетФактураВыданный.УдалитьПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	(ВЫРАЗИТЬ(СчетФактураВыданный.УдалитьПлатежноРасчетныеДокументы КАК СТРОКА(10))) <> """"");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбновитьСчетФактуру(Выборка.Документ, Выборка.ПлатежноРасчетныеДокументы);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Платежно расчетные документы.Окончание обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
		УровеньЖурналаРегистрации.Информация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует пустую таблицу "Платежно расчетных документов".
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Пустая таблица с колонками "Номер" и "Дата".
//
Функция ПустаяТаблица()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Таблица.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Возврат Таблица;
	
КонецФункции // ПустаяТаблица()

// Выполняет перенос ПРД из строки в табличную часть для конкретного документа
//
Процедура ОбновитьСчетФактуру(Документ, ПлатежноРасчетныеДокументы)
	
	Если Документ.Пустая() ИЛИ ПустаяСтрока(ПлатежноРасчетныеДокументы) Тогда
		Возврат;
	КонецЕсли;
	
	ПРД = ПолучитьПлатежноРасчетныеДокументы(Документ.ДокументОснование, Документ.ДоговорВзаиморасчетов);
	
	Если ПРД.Количество() > 0 Тогда
		
		Объект = Документ.ПолучитьОбъект();
		Объект.УдалитьПлатежноРасчетныеДокументы = "";
		Объект.ПлатежноРасчетныеДокументы.Загрузить(ПРД);
		Объект.ОбменДанными.Загрузка = Истина;
		
		Попытка
			Объект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Платежно расчетные документы.Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Документ);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет разбивку строки платежного поручения на номер и дату в документе выписки.
//
Процедура ОбновитьВыписку(Документ)
	
	Объект = Документ.ПолучитьОбъект();
	ОбъектМодифицировался = Ложь;
	
	Для Каждого Строка Из Объект.Состав Цикл
		
		Если ЗначениеЗаполнено(Строка.ПлатежноеПоручениеОснование)
			И ТипЗнч(Строка.ПлатежноеПоручениеОснование) = Тип("Строка") Тогда
			
			ЗначенияРеквизитов = ПлатежноРасчетныеДокументыКлиентСервер
				.РазбитьПредставление(СтрРазделить(Строка.ПлатежноеПоручениеОснование, ";", Ложь)[0]);
			Строка.НомерВходящегоДокумента = ЗначенияРеквизитов.Номер;
			Строка.ДатаВходящегоДокумента = ЗначенияРеквизитов.Дата;
			Строка.ПлатежноеПоручениеОснование = Неопределено;
			ОбъектМодифицировался = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОбъектМодифицировался Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Платежно расчетные документы.Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Документ);
	КонецПопытки;
	
КонецПроцедуры

// Выполняет разбивку строки платежного поручения на номер и дату в документе выписки.
//
Процедура ОбновитьСтрокуВыписки(Документ)
	
	Объект = Документ.ПолучитьОбъект();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПлатежноеПоручениеОснование)
		ИЛИ ТипЗнч(Объект.ПлатежноеПоручениеОснование) <> Тип("Строка") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗначениеРеквизитов = ПлатежноРасчетныеДокументыКлиентСервер.РазбитьПредставление(СтрРазделить(Объект.ПлатежноеПоручениеОснование, ";", Ложь)[0]);
	Объект.НомерВходящегоДокумента = ЗначениеРеквизитов.Номер;
	Объект.ДатаВходящегоДокумента = ЗначениеРеквизитов.Дата;
	Объект.ПлатежноеПоручениеОснование = Неопределено;
	
	Для Каждого Строка Из Объект.Состав Цикл
		
		ЗаполнитьЗначенияСвойств(Строка, Объект, "НомерВходящегоДокумента,ДатаВходящегоДокумента");
		Строка.ПлатежноеПоручениеОснование = Неопределено;
		
	КонецЦикла;
	
	Попытка
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Платежно расчетные документы.Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Документ);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
